app/controllers/comments_controller.rb

def create
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "movie_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "I am adding a comment!"], ["commenter", "Stefan"], ["created_at", Sun, 01 Dec 2013 17:04:13 UTC +00:00], ["movie_id", 1], ["updated_at", Sun, 01 Dec 2013 17:04:13 UTC +00:00]]

def destroy
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.find(params[:id])
    @comment.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ? AND "comments"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]