app/controllers/movies_controller.rb

INSERT INTO "movies" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 29 Nov 2013 06:32:32 UTC +00:00], ["text", "First movie!"], ["title", "Stefan"], ["updated_at", Fri, 29 Nov 2013 06:32:32 UTC +00:00]]
---
  def create

  	#render text: params[:movie].inspect
  	@movie = Movie.new(movie_params)
  	if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
  	#instance variables get passed to the new
  	@movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "movies"."id" = 3  [["title", "kjhgkjhkjhkljh"], ["text", "jkhlkh"], ["updated_at", Fri, 29 Nov 2013 16:35:57 UTC +00:00]]
---
  def update
  @movie = Movie.find(params[:id])

  if @movie.update(params[:movie].permit(:title, :text))